Revit 2026 API

# View3DRestoreOrientationAndLock Method

---

Locks the view and restores its orientation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RestoreOrientationAndLock()
```
```vb
Public Sub RestoreOrientationAndLock
```
```cpp
public:
void RestoreOrientationAndLock()
```
```fsharp
member RestoreOrientationAndLock : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | View has never been locked. |

#### Reference

View3D Class

Autodesk.Revit.DB Namespace